USE muzstore;

INSERT INTO users (firstname, lastname, email, phone, birthday_at, hometown) VALUES 
('Daniel', 'Howard', 'howarddan11@mail.ru', 89817174201, '2000-05-10', 'Moscow'),
('Vanessa', 'Melborn', 'waza@mail.com', 39214237357, '1968-12-01', 'New York'),
('Evgeniy', 'Bajenov', 'badcom@mail.ru', 89113664421, '1993-10-10', 'Moscow'),
('Valeriy', 'Viktorov', 'val@yandex.ru', 89114448259, '1999-03-03', 'Orel'),
('Artem', 'Vinogradov', 'vin@yahoo.com', 89113797654, '2001-11-24', 'Omsk'),
('Vasiliy', 'baranov', 'baran@mail.ru', 89815436566, '1965-10-01', 'Kaliningrad'),
('Verona', 'Andreas', 'sanandr@yahoo.com', 375678999, '1989-09-09', 'Miami'),
('Urii', 'Krash', 'krash@mail.com', 89119877766, '1970-05-21', 'Spb'),
('Alex', 'Maroy', 'mar.al@yahoo.com', 3754443321, '1999-01-01', 'Toronto'),
('Elena', 'Krip', 'krip@mail.ru', 8911188231, '1981-11-11', 'Sochi'),
('Andrey', 'Kumirovich', 'kuma@mail.com', 8911032124, '1976-10-04', 'Moscow'),
('Artem', 'Fedorov', 'fedya@mail.ru', 8981241255, '1955-01-01', 'Orel'),
('Vladimir', 'Lolzov', 'lol@yahoo.com', 891284124, '1989-07-07', 'Omsk'),
('Alex', 'Vinokurov', 'vino@mail.com', 8912849181, '2010-04-11', 'Spb'),
('Pol', 'Lock', 'locker@yahoo.com', 275231124, '2019-01-25', 'Miami'),
('Bob', 'Titskiy', 'bobtitskiy@yahoo.com', 3451287995, '1790-02-09', 'Toronto');

INSERT INTO catalogs (name) VALUES
('Гитары'),
('Клавишные инструменты'),
('Ударные инструменты'),
('Микрофоны'),
('DJ оборудование'),
('Наушники'),
('Коммутация');

INSERT INTO payment_type (name) VALUES
('Наличные'),
('Кредитная карта'),
('Перевод'),
('бонусы');

INSERT INTO bonuses (user_id, total) VALUES 
(1, 300),
(4, 700),
(5, 100),
(16, 500),
(11, 3000),
(7, 1000);

INSERT INTO storehouses (name) VALUES
('Основной склад'),
('Доп. склад 1'),
('Доп. склад 2');

INSERT INTO products (name, description, price, catalog_id) VALUES
('FENDER CD-60 DREAD V4 DS NAT WN', 'акустическая гитара, форма корпуса - блок', 18000, 1),
('ROCKDALE Folk Novel F1BK', 'Акустическая гитара. Форма корпуса Folk', 8900, 1),
('YAMAHA FSX315C', 'электроакустическая гитара c однополосным активным предусилителем и датчиком', 20000, 1),
('CRAFTER D-7 /NC', 'Гитара акустическая шестиструнная', 31890, 1),
('IBANEZ PF15ECE-BK', 'электроакустическая гитара, корпус дредноут черного цвета с вырезом', 29200, 1),
('EPIPHONE Toby Deluxe-IV Bass TRS', ' бас-гитара 4-струнная, цвет красный', 39200, 1),
('CASIO CT-S100', 'Синтезатор, 61 клавиша фортепианного типа', 9990, 2),
('Casio CTK-3500', 'Синтезатор , 61 клавиша, блок питания в комплекте', 17480, 2),
('KORG EK-50', 'синтезатор с автоаккомпаниментом 61 клавиша', 43000, 2),
('Sam Martin UP110B', 'Пианино акустическое, 88 клавиш', 238000, 2),
('Samick JS112RID/MAHP', 'пианино,112x148x56, 207кг, струны "Roslau"(нем.), полир., красное дерево', 450000, 2),
('TAMA SG52KH4-BK STAGESTAR', 'ударная установка из 5-ти барабанов (цвет - BLACK) со стойками', 46750, 3),
('TAMA LBZ1445 S.L.P. Sound Lab Project Dynamic Bronze', '4,5`x14` малый барабан, материал 1,2мм бронза', 57000, 3),
('Pearl RS525SC/C31', 'Ударная установка с комплектом стоек и тарелок, 2 коробки (RS525SC/CA31, RS525SC/CB31)', 57990, 3),
('BEHRINGER B-1', 'студийный конденсаторный микрофон', 8340, 4),
('NEUMANN TLM 102', 'студийный конденсаторный микрофон', 50000, 4),
('AKG P170', 'микрофон конденсаторный кардиоидный', 4745, 4),
('Shure MV7 -K-BNDL', 'премиальный комплект для записи подкастов', 19990, 4),
('PIONEER DDJ-400', 'двухканальный контроллер для rekordbox dj', 24490, 5),
('NUMARK Mixtrack Platinum FX', 'DJ-контроллер для Serato', 23400, 5),
('AKG K92', 'наушники закрытые 16-22000Гц, 32 Ома', 4000, 6),
('AKG K52', 'наушники закрытые 18-20000Гц, 32 Ома', 2000, 6),
('ROLAND RH-5', 'закрытые наушники', 2466, 6),
('AKG K72', 'наушники закрытые 16-20000Гц, 32 Ома', 2010, 6),
('Axelvox HD241', 'Наушники динамические полуоткрытого типа', 2690, 6),
('ROCKDALE XJ001-2M', 'готовый микрофонный кабель', 600, 7);

INSERT INTO reviews (user_id, product_id, body) VALUES
(1, 16, 'Отличное качество!'),
(7, 1, 'Топ за свои деньги'),
(8, 8, 'средняк('),
(9, 2, 'долго везли!'),
(16, 25, 'такое('),
(15, 16, 'Супер!'),
(1, 15, 'не так уж и плохо)'),
(2, 15, 'средняк'),
(3, 15, 'звонко!'),
(4, 26, 'плохой звук('),
(13, 13, 'привезли не рабочий!'),
(7, 6, 'не очень');

INSERT INTO storehouses_products (storehouse_id, product_id, value) VALUES
(1, 1, 97),
(1, 2, 30),
(1, 3, 45),
(1, 4, 90),
(1, 5, 120),
(1, 6, 300),
(2, 7, 100),
(2, 8, 400),
(2, 9, 167),
(3, 10, 180),
(3, 11, 10),
(3, 12, 24),
(1, 13, 100),
(1, 14, 223),
(1, 15, 80),
(1, 16, 23),
(2, 17, 10),
(2, 18, 200),
(2, 19, 100),
(3, 20, 12),
(3, 21, 200),
(3, 22, 13),
(2, 23, 20),
(2, 24, 90),
(3, 25, 200),
(1, 26, 300);

INSERT INTO discounts (product_id, discount, started_at, finished_at) VALUES 
(10, 0.2, '2022-01-01 00:00:00', '2022-02-01 00:00:00'),
(11, 0.5, '2022-01-01 00:00:00', '2022-02-01 00:00:00'),
(7, 0.2, '2022-01-01 00:00:00', '2022-02-01 00:00:00'),
(1, 0.1, '2022-01-01 00:00:00', '2022-02-01 00:00:00'),
(3, 0.3, '2022-01-01 00:00:00', '2022-02-01 00:00:00'),
(21, 0.2, '2022-01-01 00:00:00', '2022-02-01 00:00:00'),
(26, 0.4, '2022-01-01 00:00:00', '2022-02-01 00:00:00');

INSERT INTO orders (user_id, payment_type_id) VALUES
(1, 4),
(1, 2),
(1, 1),
(2, 3),
(4, 1),
(4,2),
(15, 1),
(16, 1),
(11, 2),
(13, 2),
(14, 1),
(11, 1),
(1, 1);

INSERT INTO orders_products (order_id, product_id) VALUES
(1, 26),
(2, 16),
(3, 15),
(4, 10),
(5, 21),
(6, 20),
(7, 15),
(8, 9),
(9, 1),
(10, 2),
(11, 4),
(12, 5),
(13, 7),
(9, 2),
(9, 3);

